Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ12MC201.h
#define _P2TCON_PTOPS2_POSITION                  0x00000006
#define _P2TCON_PTOPS2_MASK                      0x00000040
#define _P2TCON_PTOPS2_LENGTH                    0x00000001

#define _P2TCON_PTOPS3_POSITION                  0x00000007
#define _P2TCON_PTOPS3_MASK                      0x00000080
#define _P2TCON_PTOPS3_LENGTH                    0x00000001

#define _P2TMR_PTMR_POSITION                     0x00000000
#define _P2TMR_PTMR_MASK                         0x00007FFF
#define _P2TMR_PTMR_LENGTH                       0x0000000F

#define _P2TMR_PTDIR_POSITION                    0x0000000F
#define _P2TMR_PTDIR_MASK                        0x00008000
#define _P2TMR_PTDIR_LENGTH                      0x00000001

#define _P2TPER_PTPER_POSITION                   0x00000000
#define _P2TPER_PTPER_MASK                       0x00007FFF
#define _P2TPER_PTPER_LENGTH                     0x0000000F

#define _P2SECMP_SEVTCMP_POSITION                0x00000000
#define _P2SECMP_SEVTCMP_MASK                    0x00007FFF
#define _P2SECMP_SEVTCMP_LENGTH                  0x0000000F

#define _P2SECMP_SEVTDIR_POSITION                0x0000000F
#define _P2SECMP_SEVTDIR_MASK                    0x00008000
#define _P2SECMP_SEVTDIR_LENGTH                  0x00000001

#define _PWM2CON1_PEN1L_POSITION                 0x00000000
#define _PWM2CON1_PEN1L_MASK                     0x00000001
#define _PWM2CON1_PEN1L_LENGTH                   0x00000001

#define _PWM2CON1_PEN1H_POSITION                 0x00000004
#define _PWM2CON1_PEN1H_MASK                     0x00000010
#define _PWM2CON1_PEN1H_LENGTH                   0x00000001

#define _PWM2CON1_PMOD1_POSITION                 0x00000008
#define _PWM2CON1_PMOD1_MASK                     0x00000100
#define _PWM2CON1_PMOD1_LENGTH                   0x00000001

#define _PWM2CON2_UDIS_POSITION                  0x00000000
#define _PWM2CON2_UDIS_MASK                      0x00000001
#define _PWM2CON2_UDIS_LENGTH                    0x00000001

#define _PWM2CON2_OSYNC_POSITION                 0x00000001
#define _PWM2CON2_OSYNC_MASK                     0x00000002
#define _PWM2CON2_OSYNC_LENGTH                   0x00000001

#define _PWM2CON2_IUE_POSITION                   0x00000002
#define _PWM2CON2_IUE_MASK                       0x00000004
#define _PWM2CON2_IUE_LENGTH                     0x00000001

#define _PWM2CON2_SEVOPS_POSITION                0x00000008
#define _PWM2CON2_SEVOPS_MASK                    0x00000F00
#define _PWM2CON2_SEVOPS_LENGTH                  0x00000004

#define _PWM2CON2_SEVOPS0_POSITION               0x00000008
#define _PWM2CON2_SEVOPS0_MASK                   0x00000100
#define _PWM2CON2_SEVOPS0_LENGTH                 0x00000001

#define _PWM2CON2_SEVOPS1_POSITION               0x00000009
#define _PWM2CON2_SEVOPS1_MASK                   0x00000200
#define _PWM2CON2_SEVOPS1_LENGTH                 0x00000001

#define _PWM2CON2_SEVOPS2_POSITION               0x0000000A
#define _PWM2CON2_SEVOPS2_MASK                   0x00000400
#define _PWM2CON2_SEVOPS2_LENGTH                 0x00000001

#define _PWM2CON2_SEVOPS3_POSITION               0x0000000B
#define _PWM2CON2_SEVOPS3_MASK                   0x00000800
#define _PWM2CON2_SEVOPS3_LENGTH                 0x00000001

#define _P2DTCON1_DTA_POSITION                   0x00000000
#define _P2DTCON1_DTA_MASK                       0x0000003F
#define _P2DTCON1_DTA_LENGTH                     0x00000006

#define _P2DTCON1_DTAPS_POSITION                 0x00000006
#define _P2DTCON1_DTAPS_MASK                     0x000000C0
#define _P2DTCON1_DTAPS_LENGTH                   0x00000002

#define _P2DTCON1_DTB_POSITION                   0x00000008
#define _P2DTCON1_DTB_MASK                       0x00003F00
#define _P2DTCON1_DTB_LENGTH                     0x00000006

#define _P2DTCON1_DTBPS_POSITION                 0x0000000E
#define _P2DTCON1_DTBPS_MASK                     0x0000C000
#define _P2DTCON1_DTBPS_LENGTH                   0x00000002

#define _P2DTCON1_DTA0_POSITION                  0x00000000
#define _P2DTCON1_DTA0_MASK                      0x00000001
#define _P2DTCON1_DTA0_LENGTH                    0x00000001

#define _P2DTCON1_DTA1_POSITION                  0x00000001
#define _P2DTCON1_DTA1_MASK                      0x00000002
#define _P2DTCON1_DTA1_LENGTH                    0x00000001

#define _P2DTCON1_DTA2_POSITION                  0x00000002
#define _P2DTCON1_DTA2_MASK                      0x00000004
#define _P2DTCON1_DTA2_LENGTH                    0x00000001

#define _P2DTCON1_DTA3_POSITION                  0x00000003
#define _P2DTCON1_DTA3_MASK                      0x00000008
#define _P2DTCON1_DTA3_LENGTH                    0x00000001

#define _P2DTCON1_DTA4_POSITION                  0x00000004
#define _P2DTCON1_DTA4_MASK                      0x00000010
#define _P2DTCON1_DTA4_LENGTH                    0x00000001

#define _P2DTCON1_DTA5_POSITION                  0x00000005
#define _P2DTCON1_DTA5_MASK                      0x00000020
#define _P2DTCON1_DTA5_LENGTH                    0x00000001

#define _P2DTCON1_DTAPS0_POSITION                0x00000006
#define _P2DTCON1_DTAPS0_MASK                    0x00000040
#define _P2DTCON1_DTAPS0_LENGTH                  0x00000001

#define _P2DTCON1_DTAPS1_POSITION                0x00000007
#define _P2DTCON1_DTAPS1_MASK                    0x00000080
#define _P2DTCON1_DTAPS1_LENGTH                  0x00000001

#define _P2DTCON1_DTB0_POSITION                  0x00000008
#define _P2DTCON1_DTB0_MASK                      0x00000100
#define _P2DTCON1_DTB0_LENGTH                    0x00000001

#define _P2DTCON1_DTB1_POSITION                  0x00000009
#define _P2DTCON1_DTB1_MASK                      0x00000200
#define _P2DTCON1_DTB1_LENGTH                    0x00000001

#define _P2DTCON1_DTB2_POSITION                  0x0000000A
#define _P2DTCON1_DTB2_MASK                      0x00000400
#define _P2DTCON1_DTB2_LENGTH                    0x00000001

#define _P2DTCON1_DTB3_POSITION                  0x0000000B
#define _P2DTCON1_DTB3_MASK                      0x00000800
#define _P2DTCON1_DTB3_LENGTH                    0x00000001

#define _P2DTCON1_DTB4_POSITION                  0x0000000C
#define _P2DTCON1_DTB4_MASK                      0x00001000
#define _P2DTCON1_DTB4_LENGTH                    0x00000001

